package zorkproject.Classes.Game.Classes;

/**
 * Ειναι τα μυνηματα που θα δινει ως απαντηση στην διαδραστικοτητα του παιχνιδιου με τον παιχτη.
 */
public class Message {
    private String message = "";
    public void message (){

    }
    private void welcomeMessage() {
        message = "Γεια σου και καλως ηρθες στο Zork text-based game μας !!\n"
                + "Το παιχνιδι διαδραματιζεται στην Κεντρικη μακεδονια το ετος 150 μ.χ.\n"
                + " με πρωταγωνιστη τον μικρο Αιαντα, οπου βρισκεται στο Καστρο της Αμφιπολης.\n"
                + " Σκοπος σου ειναι να βοηθησεις τον μικρο Αιαντα να λυσει το μυστηριο που κρυβει το καστρο μετα την \n"
                + " καταλυψη του απο τους Ρωμαιους, κατα την πτωση του Μακεδονικου Βασιλειου, και να λυσεις τον γρυφο \n"
                + "του Βασιλια Περσεα. Ας παιξουμε !!!! \n"
                + "Πληκτρολογησε NEW, παραμυθι να κυλήσει και παιχνιδι να αρχινησει !!! ";
    }
    public String getWelcomeMessage() {
        welcomeMessage();
        return message;
    }
}
