package zorkproject.Classes.Game.Classes;

/**
 * Ειναι τα μυνηματα που θα δινει ως απαντηση στην διαδραστικοτητα του παιχνιδιου με τον παιχτη.
 */
public class Message {
    private String message = "";
    public Message (){
        message = "";
    }
    public Message(String m) {
        message = m;
    }
    private void welcomeMessage() {
        message = "Γεια σου και καλως ηρθες στο Zork text-based game μας !!\n"
                + "Το παιχνιδι διαδραματιζεται στην Κεντρικη μακεδονια το ετος 150 μ.χ.\n"
                + " με πρωταγωνιστη τον μικρο Αιαντα, οπου βρισκεται στο Καστρο της Αμφιπολης.\n"
                + " Σκοπος σου ειναι να βοηθησεις τον μικρο Αιαντα να λυσει το μυστηριο που κρυβει το καστρο μετα την \n"
                + " καταλυψη του απο τους Ρωμαιους, κατα την πτωση του Μακεδονικου Βασιλειου, και να λυσεις τον γρυφο \n"
                + "του Βασιλια Περσεα. Ας παιξουμε !!!! \n"
                + "Πληκτρολογησε NEW, παραμυθι να κυλήσει και παιχνιδι να αρχινησει !!! \n";
    }
    //Κεντρικος Διαδρομος
    private void centralRoomMessage() {
        message  = "Βρισκεσαι στον κεντρικο θαλαμο του καστρου. Παλια εδω ηταν που ο βασιλιας Περσεας διασκεδαζε και \n"
                    + "εκανε τις μεγαλοπρεπεις συγκεντρωσεις του με πολυ φαγητο και κρασι. Τωρα ειναι αδειο και μονο οι "
                    +"φεγγυτες φωτιζουν τον χωρο. Προς τον Βορρα , Νοτο , Ανατολη και Δυση υπαρχουν πορτες. Ποιος ξερει"
                    +"Αραγε που μπορουν να οδηγουν ...";
    }
    //Κελαρι
    private void northRoomMessage() {
        message = "Βρισκεσαι στο κελαρι. Η υγρασια και οι αραχνες το περιβαλουν χαρακτηριστηκα. Μεσα στο σκοταδι \n"
                + "μια σκια αχνοφαινεται στο βαθος ... Μπορει να ειναι καποιο στοιχειο η και καποιος ανθρωπος.\n"
                + "Καποιος τροπος θα υπαρχει να το βρουμε.\n";
    }
    //Υπνοδωματιο
    private void southRoomMessage(){
        message  = "Βρισκεσαι στο υπνοδωματιο. Μπροστα σου εχει ενα κρεβατι (bed) απο καρυδια, με χειροποιητα κεντητα"
                +" σεντονια. Διπλα του εχει ενα παραθυρο κλειστο και κλειδομενο με ενα κλειδι. Δεξια σου βρισκεται μια "
                +"ντουλαπα (closet) οπου ειναι μισανοιχτη. Ολα τα πραγματα ειναι μισοκαμενα και μυριζουν μουχλα.";
    }
    //Σοφιτα
    private void eastRoomMessage() {
        message = "Βρισκεσαι στην σοφιτα. Το πατωμα τριζει και εχει μονο ενα κουτι.";
    }
    // Αποθηκη
    private void westRoomMessage() {

        message = "Βρισκεσαι στην αποθηκη που ειναι αδεια.";
    }
    public String getWelcomeMessage() {
        welcomeMessage();
        return message;
    }
    public void setMessage(String m) {
        message= m;
    }
    public String getMessage () {
        return message;
    }
}
